C4-JMeter/report_html/statistics.json
{
  "Random Page" : {
    "transaction" : "Random Page",
    "sampleCount" : 19,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 511.0526315789473,
    "medianResTime" : 452.0,
    "minResTime" : 425.0,
    "maxResTime" : 930.0,
    "pct1ResTime" : 631.0,
    "pct2ResTime" : 930.0,
    "pct3ResTime" : 930.0,
    "throughput" : 1.3193528227206444,
    "receivedKBytesPerSec" : 2.145372391674189,
    "sentKBytesPerSec" : 0.3143770397889036
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 32,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 444.74999999999994,
    "medianResTime" : 446.0,
    "minResTime" : 164.0,
    "maxResTime" : 1038.0,
    "pct1ResTime" : 668.8,
    "pct2ResTime" : 967.7999999999997,
    "pct3ResTime" : 1038.0,
    "throughput" : 2.2220679119505586,
    "receivedKBytesPerSec" : 62.2331592641136,
    "sentKBytesPerSec" : 0.48973921081869315
  },
  "Search Page" : {
    "transaction" : "Search Page",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 676.6666666666666,
    "medianResTime" : 583.0,
    "minResTime" : 409.0,
    "maxResTime" : 1038.0,
    "pct1ResTime" : 1038.0,
    "pct2ResTime" : 1038.0,
    "pct3ResTime" : 1038.0,
    "throughput" : 0.8125677139761647,
    "receivedKBytesPerSec" : 230.01379672264355,
    "sentKBytesPerSec" : 0.1920326042795233
  },
  "Home Page" : {
    "transaction" : "Home Page",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 249.20000000000002,
    "medianResTime" : 192.0,
    "minResTime" : 164.0,
    "maxResTime" : 685.0,
    "pct1ResTime" : 644.3000000000002,
    "pct2ResTime" : 685.0,
    "pct3ResTime" : 685.0,
    "throughput" : 1.887148518588413,
    "receivedKBytesPerSec" : 3.040815484053595,
    "sentKBytesPerSec" : 0.3427828363842234
  }
}